// Импортируем необходимые трейты для работы с вводом-выводом:
// BufRead нужен для построчного чтения (метод lines), BufReader — для буферизации,
// Write — для отправки (write_all)
use std::io::{BufRead, BufReader, Write};
// Импортируем сетевые крэйты:
// TcpListener для ожидания подключений,
// TcpStream для общения с клиентом
use std::net::{TcpListener, TcpStream};
// Импортируем крэйты синхронизации: Arc для безопасного владения данными между потоками,
// Mutex для взаимного исключения (блокировки данных от одновременного изменения)
use std::sync::{Arc, Mutex};
// Импортируем модуль для работы с операционной системой и создания новых ОС-потоков
use std::thread;

// Объявляем псевдоним типа (Type Alias), чтобы не писать длинную конструкцию.
// Из чего состоит составной тип `Arc<Mutex<Vec<TcpStream>>>`:
// 1. Vec<TcpStream> — динамический массив (список) всех подключенных клиентов.
// 2. Mutex<...> — защищает этот список. Только один поток в один момент времени может
//.   зайти в него и изменить.
// 3. Arc<...> — «умный» указатель с подсчетом ссылок. Позволяет раздать каждому потоку-клиенту
//.   ссылку на этот общий список.
type Clients = Arc<Mutex<Vec<TcpStream>>>;

/// Функция для рассылки сообщения всем подключенным клиентам
fn broadcast(clients: &Clients, message: &str, sender_addr: &str) {
    // Блокируем мьютекс. Метод lock() ждет, пока мьютекс освободится.
    // unwrap() нужен на случай "отравления" мьютекса (если другой поток запаниковал,
    // пока держал блокировку).
    let mut clients = clients.lock().unwrap();

    // Формируем строку: "IP:порт клиента: сообщение\n"
    // TODO - возможно поменять с учотом сериализации, вместо IP клиента выводить его NickName...
    let formatted = format!("{}: {}\n", sender_addr, message);

    // цикл `while` вместо `for`, так как мы будем удалять элементы прямо во время обхода списка
    let mut i = 0;
    while i < clients.len() {
        // Пытаемся отправить сообщение текущему клиенту, преобразовав строку в массив байт (.as_bytes())
        // Если write_all вернул ошибку (is_err() == true) — значит, клиент внезапно отключился
        // или связь прервалась.
        if clients[i].write_all(formatted.as_bytes()).is_err() {
            // Удаляем сломанный сокет из списка.
            clients.remove(i);
        } else {
            // Если отправка прошла успешно, просто переходим к следующему клиенту
            i += 1;
        }
    }
}

/// Функция, которая выполняется в отдельном потоке ОС для каждого конкретного клиента
fn handle_client(stream: TcpStream, clients: Clients) {
    // Пытаемся узнать сетевой адрес (IP и порт) подключившегося клиента на той стороне кабеля
    let peer = match stream.peer_addr() {
        Ok(addr) => addr,
        Err(e) => {
            // Если операционная система не смогла вернуть адрес, логируем ошибку и завершаем
            // работу с этим клиентом
            eprintln!("[server-error] Клиент не определился: {}", e);
            return;
        }
    };

    println!("[server] connected: {}", peer);

    // Нам нужно сделать две вещи: читать данные из сокета (в этом потоке) и уметь писать
    // в сокет (из функции broadcast).
    // Для этого мы клонируем сокет (создаем второй файловый дескриптор, указывающий
    // на то же сетевое соединение).
    match stream.try_clone() {
        Ok(clone) => {
            // Захватываем список клиентов, чтобы добавить туда текущий клон для рассылки сообщений
            let mut list = clients.lock().unwrap();
            list.push(clone);
        } // Мьютекс `list` здесь автоматически разблокируется
        Err(e) => {
            eprintln!("[server] Ошибка добавления нового клиента: {}", e);
            return;
        }
    }

    // Оборачиваем ОРИГИНАЛЬНЫЙ сокет в BufReader.
    let reader = BufReader::new(stream);

    // Бесконечно читаем данные построчно (разделитель — символ '\n').
    // Этот цикл «спит» (блокирует поток), пока клиент ничего не пишет.
    for line in reader.lines() {
        match line {
            Ok(msg) => {
                // Если строка успешно прочитана, выводим её в консоль сервера...
                // TODO - идея вместо сервера клиента выводить его NickName
                match msg.contains(":stop:") {
                    true => {
                        println!("Клиент {} запросил остановку сервера.", peer);
                        std::process::exit(0); // Сервер полностью закрывается прямо сейчас
                    }
                    false => {
                        println!("[{}] {}", peer, msg);
                        // рассылка сообщения всем остальным участникам чата
                        broadcast(&clients, &msg, &peer.to_string());
                    }
                }
            }
            Err(e) => {
                // Ошибка чтения обычно означает, что клиент закрыл приложение или оборвал связь
                eprintln!("[server] read error from {}: {}", peer, e);
                break; // Выходим из цикла чтения строк
            }
        }
    }

    // Если мы дошли сюда, значит клиент отключился (цикл завершился). Изымаем сокет из списка рассылки.
    let mut list = clients.lock().unwrap();
    // Метод retain оставляет в списке только те элементы, для которых условие вернуло `true`.
    // Мы проверяем адрес каждого сокета в списке: если он равен адресу текущего отключившегося (`peer`),
    // то мы его удаляем из чата.
    list.retain(|client| client.peer_addr().map(|addr| addr != peer).unwrap_or(false));

    println!("[server] disconnected: {}", peer);
} // Поток завершает свою работу, память очищается

// - - - - - - - - - -- - - - -- - - - -- - - - -- - - - -- - - - - Вход в программу server
fn main() -> std::io::Result<()> {
    // 1. "Привязываем" сервер к локальному IP на порт 44370.
    let listener = TcpListener::bind("127.0.0.1:44370")?;
    println!("Сервер запущен и ждет подключений... на: 127.0.0.1:44370");

    // Создаем пустой список клиентов, оборачивая его в Мьютекс и Arc.
    let clients: Clients = Arc::new(Mutex::new(Vec::new()));

    // 2. Метод incoming() — это бесконечный итератор. Он блокирует главный поток
    //    и ждет новых сетевых подключений.
    for stream in listener.incoming() {
        match stream {
            Ok(stream) => {
                // Клонируем умный указатель Arc.
                // новая копия ссылки уходит внутрь нового потока.
                let clients = Arc::clone(&clients);

                // thread::spawn новый поток операционной системы, работает не зависимо от
                thread::spawn(move || handle_client(stream, clients));
            }
            Err(e) => eprintln!("[server] accept error: {}", e),
        }
    }

    Ok(())
} // main()
